// @ts-ignore
console.log('lesson 1');

////////// The helpful links for lesson
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Data_structures
// https://learn.javascript.ru/object
// https://learn.javascript.ru/array
// https://metanit.com/web/javascript/3.2.php
// https://learn.javascript.ru/function-basics
// https://learn.javascript.ru/arrow-functions-basics
// https://learn.javascript.ru/while-for
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Math

// The helpful links about js
// https://learn.javascript.ru/
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference
// https://metanit.com/web/javascript/
// https://metanit.com/web/typescript/1.1.php

// Task 01
// 1. Объявить и типизировать строковую константу и присвоеить ей значение 'Hello'
// 2. Объявить переменную, присвоить ей любое число и типизировать ее.

// Task 02
// 1. объявить переменную и присвоеить ей массив с любыми 3мя строковыми значениями, переменную необходимо типизировать
// 2. объявить переменную и присвоеить ей объект с любыми 3мя ключами и значениями, переменную необходимо типизировать

// Task 03
// 1. Написать и типизировать стрелочную функцию которая выводит в коносль 'Hi there!'
// 2. Создать и типизировать объект с ключами Имя, Возраст, Пол - значения по клчам произвольные
// 3. Написать и типизировать функцию (function declaration) которая в качестве аргумента принимает объект из пункта 2 и
// добовляет этому объекту новый ключ 'sayHello' значение у которого функция из пункта 1

// Task 04
// 1. Написать и типизировать стрелочную функцию которая возрощает случайное целое число от 0 до 100;
// 2. Написать и типизировать функцию (function declaration) которая в качестве аргумента принимает 'name' и возвращает
// объект с клчом 'name' и значением 'name' из аргумента и ключом 'age' cо значением сгенерированным функцией из пункта 1
// 3. Создать и типизировать массив который будет содержать 3 объекта сгенерированных функцией из пункта 2

// Task 05
// 1. Написать и типизировать функцию которая возврщает строку "less then 20";
// 2. Написать и типизировать функцию которая возврщает строку "hmm... somewhere between 20 and 60";
// 3. Написать и типизировать функцию которая возврщает строку "greater than 60 ";
// 4. Создать и типизировать пустой массив стор;
// 5. Написать и типизировать функцию которая принимает в качестве аргумента число сгенерированное функцией из Task 04/1.
// Данная функция должна в зависсимости от полученного числа генерировать строку одной из функций из первых 3х пунктов.
// Сгенерированная строка должна помещаться в массив из пунка 4.
// 6. Функция в пункте 5 должна вызываться в цикле столько раз сколько сгенерирует функция из Task 04/1.
// 7. Вывести в консоль все элементы массива.