// типы данных - google
// map - google
// про функиции
// https://learn.javascript.ru/function-expressions

//  про ...
// Если ... располагается в конце списка аргументов функции, то это «остаточные параметры».
// Он собирает остальные неуказанные аргументы и делает из них [массив] .

// для лучшего запоминания  (субьективно)
// [] - коробка ([_]) (массив)
// {} - пакет/мешок (объект)

// Если ответили на все эти вопросы(с первого раза) правильно
// Поздравляю вы умнее меня (среда-почти четверг) в этих вопросах п.с.
// я ответил только на 2 вопроса =) из 9    (ZybkovAC)
